sdaiCreateInstanceBN(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Creates an application instance within an associated model.
\param model      [in] A model.
\param entityName [in] A name of the entity to be created.
\returns A created application instance represented with its pointer if it was created successfully; otherwise, the function returns a NULL pointer.
\code
SdaiModel model = ...;
SdaiAppInstance cartesianPoint = sdaiCreateInstanceBN(model, "IfcCartesianPoint");
\remarks
The function is case insensitive.
The model should be accessed with the sdaiRW mode.
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiMX_NRW - SDAI-model access is not read-write.
* sdaiED_NDEF - Entity definition not defined.
* sdaiED_NVLD - Entity definition invalid.
* sdaiSY_ERR - Underlying system error.